package ru.urfu;

public class Puzzles {
    public static final String[] riddles = {"""
            На обороте разбитого бокала вы обнаруживаете надпись:
            20-1-13-1-15-20
            Рядом карандашная пометка: Мой главный дар спрятан в буквах""",
            """
            На рабочем столе среди разбросанных бумаг вы находите клочок с загадкой:
            Две сестры друг за другом бегут, а друг друга не догонят. Что это?
            Рядом чернильное пятно - будто кто-то торопился и опрокинул чернильницу.""",
            """
            На оборванном клочке бумаги в мертвой руке:
            ВОДЕЛС
            Снизу мелко: Ищи наоборот"""};

    public static final String[] answers = {"Талант", "талант", "Часы", "часы", "Следов", "следов"};
    public static final String[] rightDecision = {"""
            *Да! Вы чувствуете, что попали в точку.*
            Эта мысль заставляет вас по-новому взглянуть на кабинет.
            Вы подходите к книжным полкам и замечаете, что одна из книг - "ТАЛАНТ и призвание" - стоит немного неровно.
            Аккуратно нажав на корешок, вы слышите тихий щелчок — потайной ящик в столе приоткрывается.
            Внутри лежит пожелтевший листок — зарисовка библиотеки, сделанная чернильным пером.
            И в этот момент, глядя на схему, вы словно проваливаетесь в прошлое, туда, где разыгралась трагедия.
            Детали начинают складываться в картину...
            """,
            """
            *Тихий щелчок в вашем сознании - и все встает на свои места.*
            Ваш взгляд непроизвольно скользит к настенным часам, стрелки которых замерли в немом свидетельстве произошедшего.
            Эта простая ассоциация обостряет ваше восприятие.
            Вы замечаете то, что раньше упускали: тонкую паутину, колеблющуюся от сквозняка из окна, и едва видимые следы на полу, будто кто-то торопился и не рассчитал шаг.
            Время здесь остановилось, но улики продолжают говорить...
            """,
            """
            *Именно! Это слово будто включает ваше детективное чутье.*
            В полумраке кладовой ваш взгляд теперь цепляется за малейшие детали.
            Покачивающаяся лампа отбрасывает движущиеся тени, и вы замечаете то, что было скрыто - едва различимые следы на полу, крошечные предметы в пыли.
            Кажется, сама комната начинает говорить с вами на языке улик...
            """};
}
